# Creación de DataFrame

In [2]:
import pandas as pd

In [3]:
#Crea un DataFrame llamado df con las siguientes columnas: "Nombre", "Edad", "Ciudad".
#Ingresa al menos 5 filas de datos.
data = {"Nombre":["Juan","Maria","Carlos","Ana","Pedro"],
        "Edad":[25,30,22,28,35],
        "Ciudad": ["Buenos Aires","Madrid","Mexico DF","Lima","Caba"]}
        
df = pd.DataFrame(data)

In [10]:
df

   Nombre  Edad        Ciudad
0    Juan    25  Buenos Aires
1   Maria    30        Madrid
2  Carlos    22     Mexico DF
3     Ana    28          Lima
4   Pedro    35          Caba

# Operaciones básicas

In [12]:
#Imprime las primeras 3 filas del DataFrame df
df.head(3)

   Nombre  Edad        Ciudad
0    Juan    25  Buenos Aires
1   Maria    30        Madrid
2  Carlos    22     Mexico DF

In [17]:
#Calcula la media de la columna "Edad".

media_edad = df["Edad"].mean()

media_edad

28.0

In [16]:
#Filtra las filas donde la edad sea mayor a 25.

filtrado = df[df["Edad"] > 25]

filtrado

  Nombre  Edad  Ciudad
1  Maria    30  Madrid
3    Ana    28    Lima
4  Pedro    35    Caba

# Agregar y eliminar columnas

In [18]:
#Agrega una nueva columna llamada "Pais" con valores arbitrarios

df["Pais"] = ["Argentina","Paraguay","Chile","Bolivia","Ecuador"]

df

   Nombre  Edad        Ciudad       Pais
0    Juan    25  Buenos Aires  Argentina
1   Maria    30        Madrid   Paraguay
2  Carlos    22     Mexico DF      Chile
3     Ana    28          Lima    Bolivia
4   Pedro    35          Caba    Ecuador

In [19]:
#Elimina la columna "Ciudad"

df = df.drop("Ciudad",axis = 1)

df

   Nombre  Edad       Pais
0    Juan    25  Argentina
1   Maria    30   Paraguay
2  Carlos    22      Chile
3     Ana    28    Bolivia
4   Pedro    35    Ecuador